(function () {
var module = {
    exports: null
};

module.exports = {
    'id': 'sa',
	'leftmin' : 2,
	'rightmin' : 2,
	'patterns' : {
		2 : "o12ఁ2ః2̮2̐2̄2̈á1à1ā1í1ì1ï1ī1ú1ù1ü1ū1é1è1a1ò12ൗ2ഃ2ം2ంe12ँ2ं2ः2॑2॒2ౕ2ౖ2ঁ2ং2ঃ2়2ৗ2ೖ2ೕ2ೲ2ೱ2ಃ2ಂu12ઁ2ં2ઃi1ó1",
		3 : "1ఢ11డ11ఠ11ట11ఞ11ఝ11జ11ఛ11చ11ఙ1l̥1ḷ1ï12̱12́12̀1ī1ā1ü1ū1r̥1ṛ12‍22k_1హ12g_1స11ష12c_1శ12j_1వ11ఘ11గ11ఖ11క12ౌ12ో12ṅ_2ñ_2ṭ_2ొ12ḍ_2ై12ṇ_2ḷ_2ś_2ṣ_2ే12ె12ṃ12ṁ12ḥ12ẖ12ḫ11अ11आ11इ11ई11उ11ऊ11ऋ11ॠ11ऌ11ॡ11ए11ऐ11ओ11औ12ा12ि12ी12ु12ू12ृ12ॄ12ॢ12ॣ12े12ै12ो12ौ11क11ख11ग11घ11ङ11च11छ11ज11झ11ञ11ट11ठ11ड11ढ11ण11त11थ11द11ध11न11प11फ11ब11भ11म11य11र11ल11ळ11व11श11ष11स11ह12ౄ12ృ12ూ12ు12ీ12ి12ా11ఔ11ఓ11ఒ11ఐ11ఏ11ఎ11ౡ11ఌ11ౠ11ఋ11ఊ11ఉ11ఈ11ఇ11ఆ11అ12്21ళ11ల12్22ൿ12ൾ12ൽ12ർ12ൻ12ൺ11ఱ11ర11ഹ11സ11ഷ11య12t_1మ12ऽ22d_1భ12्21অ11আ11ই11ঈ11উ11ঊ11ঋ11ৠ11ঌ11ৡ11এ11ঐ11ও11ঔ12া12ি12ী12ু12ূ12ৃ12ৄ12ৢ12ৣ12ে12ৈ12ো12ৌ11ক11খ11গ11ঘ11ঙ11চ11ছ11জ11ঝ11ঞ11ট11ঠ11ড11ড়11ঢ11ঢ়11ণ11ত11থ11দ11ধ11ন11প11ফ11ব11ভ11ম11য11য়11র11ল11শ11ষ11স11হ11ৎ21ശ11വ12n_1ഴ11ള11ല12p_1റ11ര11യ11മ11ഭ11ബ11ഫ11പ11ന11ധ11ദ11ഥ11ത11ണ11ഢ11ഡ11ഠ11ട11ഞ11ഝ11ജ11ഛ11ച11ങ11ഘ11ഗ11ഖ11ക12ൌ12ോ12ൊ12ൈ11బ12b_1ఫ12ঽ22m_2y_2্21અ11આ11ઇ11ઈ11ઉ11ઊ11ઋ11ૠ11ઌ11ૡ11એ11ઐ11ઓ11ઔ12ા12િ12ી12ુ12ૂ12ૃ12ૄ12ૢ12ૣ12ે12ૈ12ો12ૌ11ક11ખ11ગ11ઘ11ઙ11ચ11છ11જ11ઝ11ઞ11ટ11ઠ11ડ11ઢ11ણ11ત11થ11દ11ધ11ન11પ11ફ11બ11ભ11મ11ય11ર11લ11ળ11વ11શ11ષ11સ11હ12േ12‌22െ12ൃ12ൂ12ു12ീ12ി12ാ11ഔ11ഓ11ഒ11ഐ11ഏ11എ11ൡ11ഌ11ൠ11ഋ11ഊ11ഉ11ഈ11ഇ11ആ11അ12್22r_2l_2ಽ21ప12v_1న11ధ12s_1ಹ11ಸ11ಷ11ಶ12h_1ద11థ12ઽ22્21ಅ11ಆ11ಇ11ಈ11ಉ11ಊ11ಋ11ೠ11ಌ11ೡ11ಎ11ಏ11ಐ11ಒ11ಓ11ಔ12ಾ12ಿ12ೀ12ು12ೂ12ೃ12ೄ12ೆ12ೇ12ೈ12ೊ12ೋ12ೌ11ಕ11ಖ11ಗ11ಘ11ಙ11ಚ11ಛ11ಜ11ಝ11ಞ11ಟ11ಠ11ಡ11ಢ11ಣ11ತ11ಥ11ದ11ಧ11ನ11ಪ11ಫ11ಬ11ಭ11ಮ11ಯ11ರ11ಱ11త11ಲ11ಳ11ೞ11ణ11ವ1",
		4 : "2റ്_2ખ્_r̥̄1ṝ12ಕ್_2ಖ್_2ಗ್_2ಘ್_2ಙ್_2ಚ್_2ಛ್_2ಜ್_2ಝ್_2ಞ್_2ಟ್_2ಠ್_2ಡ್_2ಢ್_2ಣ್_2ತ್_2ಥ್_2ದ್_2ಧ್_2ನ್_2ಪ್_2ಫ್_2ಬ್_2ಭ್_2ಮ್_2ಯ್_2ರ್_2ಱ್_2હ્_2ಲ್_2ಳ್_2ವ್_2ಶ್_2ಷ್_2ಸ್_2ಹ್_l̥̄1ḹ1a2i1a2u12સ્_2ષ્_2શ્_2વ્_2ળ્_2લ્_2ર્_2ય્_2મ્_2ભ્_2બ્_2ફ્_2પ્_2ન્_2ધ્_2દ્_2થ્_2ત્_2ણ્_2ઢ્_2ડ્_2ઠ્_2ટ્_2ઞ્_2ઝ્_2જ્_2છ્_2ચ્_2ઙ્_2ઘ્_2ગ્_2ક્_2హ్_2స్_2ష్_2శ్_2হ্_2স্_2ষ্_2শ্_2ল্_2র্_2য়্_2য্_2ম্_2ভ্_2ব্_2ফ্_2প্_2ন্_2ধ্_2দ্_2থ্_2ত্_2ণ্_2ঢ়্_2ঢ্_2ড়্_2ড্_2ঠ্_2ট্_2ঞ্_2ঝ্_2জ্_2ছ্_2চ্_2ঙ্_2ঘ্_2গ্_2খ্_2ক্_2వ్_2ళ్_2ల్_2ക്_2ഖ്_2ഗ്_2ഘ്_2ങ്_2ച്_2ഛ്_2ജ്_2ഝ്_2ഞ്_2ട്_2ഠ്_2ഡ്_2ഢ്_2ണ്_2ത്_2ഥ്_2ദ്_2ധ്_2ന്_2പ്_2ഫ്_2ബ്_2ഭ്_2മ്_2യ്_2ര്_2ఱ్_2ర్_2ല്_2ള്_2ഴ്_2ह्_2വ്_2ശ്_2ഷ്_2സ്_2ഹ്_2య్_2మ్_2భ్_2బ్_2स्_2ष्_2श्_2व्_2ळ्_2ल्_2ఫ్_2ప్_2న్_2ధ్_2ద్_2థ్_2త్_2र्_2य्_2म्_2भ्_2ब्_2फ्_2प्_2न्_2ध्_2द्_2थ्_2त्_2ण्_2ढ्_2ड्_2ठ्_2ट्_2ञ्_2झ्_2ज्_2छ्_2च्_2ङ्_2घ्_2ग्_2ख्_2क्_2rḍ_2rṭ_2ḍh_2ṭh_a3ü1a3ï1a2ù1a2ú1a2ì1a2í12ḫ12ẖ12ḥ12m̐12ṁ12ṃ12rb_2rp_2rd_2rt_2ణ్_2ఢ్_2rg_2rk_2ṣ_2ś_2ḷ_2bh_2ph_2dh_2th_2ṇ_2డ్_2ḍ_2ఠ్_2ṭ_2ñ_2jh_2ch_2ṅ_2gh_2kh_2క్_2ఖ్_2గ్_2ఘ్_2ఙ్_2చ్_2ఛ్_2జ్_2ఝ్_2ఞ్_2ట్_",
		5 : "2ṭh_2ર્પ_2rṭ_2rḍ_2ക്‍12ള്‍12ത്‍12ല്‍12ര്‍12ന്‍12ണ്‍12ര്പ_2ര്ത_2ര്ട_2ര്ക_2ર્ટ_2ર્ત_a3ü12ḍh_2ર્ક_2ರ್ಕ_2র্ক_2র্ট_2র্ত_2র্প_2ರ್ಟ_2ರ್ತ_2ರ್ಪ_a3ï1",
		6 : "2ర్ప్_2ర్త్_2ర్ట్_2ర్క్_2र्प्_2र्त्_2र्क्_2र्ट्_"
	}
};

var h = new window['Hypher'](module.exports);
if(typeof module.exports.id === 'string') {
    module.exports.id = [module.exports.id];
}
for (var i = 0; i < module.exports.id.length; i += 1) {
  window['Hypher']['languages'][module.exports.id[i]] = h;
}
}());
